In [1]:
import requests as req

In [2]:
from bs4 import BeautifulSoup

In [3]:
import pandas as pd

In [4]:
import sqlite3 as sql

In [5]:
import requests

In [6]:
from functools import reduce

In [7]:
import numpy as np

In [8]:
sqlite_file = 'salaries_first_last.sql'

In [9]:
db = sql.connect(":memory:")

In [10]:
sql_file = open(sqlite_file)
sql_as_string = sql_file. read()
db. executescript(sql_as_string)

In [11]:
salary_query= """
SELECT 
 firstname, lastname, department,  salary
FROM Salaries
"""

In [12]:
salaries = pd.read_sql(salary_query, db)

In [13]:
salaries.head()

   firstname lastname department     salary
0         DJ   Durkin       PRES  881010.96
1  Darryll J    Pines       PRES  765000.00
2    Wallace      Loh       PRES  734565.88
3       Mark  Turgeon       PRES  723312.99
4   Brenda S    Frese       PRES  659386.43

In [14]:
def count_nonempty(d): 
    total = 0
    for k in d.keys():
        if (d.get(k) != None):
            total += 1
    print("the non empty total", total)

In [15]:
headers = {
  'Accept': 'application/json'
}

profs = dict()
matched_profs = dict()

for i in range(0, 10000, 1000):
    r = requests.get('https://api.planetterp.com/v1/professors', params={
      'limit': '1000',
      'offset': i
    }, headers = headers)

    for e in r.json():
        profs[e.get("slug")] = e
#         matched_profs[e.get("slug")] = None
    
    
print(len(matched_profs.values()))

0

In [16]:
def find_closest_match(name, matches):
    firstname = name.split(" ")[0]
    ret = [ m  for m in matches if m[0].find(firstname) >= 0 ]
    if(len(ret) > 0):
        return ret[0]
    return None

In [17]:
def get_department(dep):
    matches = dict()

    for prof in profs.values():
        
        slug = prof.get("slug")
        name = prof.get("name")
        courses = prof.get("courses")
        
        if(matched_profs.get(slug) != None):
            continue

        lastname = name.split(" ")[-1]

        salary_query= f"""
            SELECT 
            firstname, 
            lastname,
            department,
            salary
            FROM Salaries
            WHERE lastname like "{lastname}"
            AND department = "{dep}"
        """
        rows = list(db.execute(salary_query))
        matches[lastname] = (len(rows), rows, name, slug, courses)
        

    for match in matches.keys():
        (length, v, name, slug, courses) = matches.get(match)
        if(length > 0):
           
            value = find_closest_match(name, v)
         
            if(value != None):
                
                matched_profs[slug] = (
                    value[0],
                    value[1],
                    value[2],
                    value[3],
                    slug,
                    name,
                    "-".join(courses)
                )


    return

In [18]:
arr = list(set(salaries["department"]))
for dep in arr:   
    get_department(dep)

In [19]:
data =  [ list(v)  for v in matched_profs.values() ]

In [22]:
matched_salaries = pd.DataFrame(data, columns=['firstname', 'lastname', 'department', 'salary', 'slug', "planetTerpName", "courses"])
matched_salaries.head()

,firstname,lastname,department,salary,slug,planetTerpName,courses
0,Adrienne Hamcke,Wicker,SVPAAP,107237.29,wicker_adrienne,Adrienne Wicker,EDCP789
1,Siemy,Khan,SVPAAP,88720.18,khan_siemy,Siemy Khan,UNIV100
2,Alice Elizabeth,Donlan,SVPAAP,87019.18,donlan,Alice Donlan,EDHD413-EDMS451-EDHD430-EDMS645
3,Theresa M,Smith,SVPAAP,69922.37,smith_theresa,Theresa Smith,KNES131O-KNES131V
4,Jonathan,Goodson,SVPAAP,62584.65,goodson_jonathan,Jonathan Goodson,FIRE120-FIRE273-FIRE198-FIRE298-FIRE398

In [24]:
reviews_data = []
for v in data:
    
    r = requests.get('https://api.planetterp.com/v1/professor', params={
      'name': v[5],  'reviews': 'true'
    }, headers = headers).json()
    

    slug = r.get("slug")
    revs = r.get("reviews")
    if(revs == None):
        continue
        
    for rev in revs:  

        reviews_data.append([ 
            slug,
            rev.get("rating"),  
            rev.get("expected_grade"), 
            rev.get("course"),
            rev.get("review"),
        ])

In [27]:
reviews_df = pd.DataFrame(reviews_data, columns=['slug', 'rating', 'expected_grade', 'course', 'review'])
reviews_df.head()

,slug,rating,expected_grade,course,review
0,donlan,3,A,EDHD413,Donlan is a graduate student and a decent teac...
1,donlan,5,A,EDHD320,Not sure what the other reviewer was talking a...
2,donlan,2,,EDHD320,"She is a super nice lady, but I absolutely hat..."
3,goodson_jonathan,5,A+,FIRE198,Dr. Goodson is probably the most considerate p...
4,goodson_jonathan,5,A+,FIRE120,Awesome guy. Super accommodating and understan...

In [26]:
len(reviews_data)

5792

In [ ]:
data